## 측정 행, 열만 선택하는 것 배움

In [1]:
import pandas as pd # pandas 를 불러오고 밑에서 이를 pd 약자로서 쓰겠다.

In [2]:
from pandas import Series, DataFrame # pandas안의 Series와 DataFrame를 불러옴.

In [3]:
print("pandas 버전 : ", pd.__version__)

pandas 버전 :  1.1.3

## 실습

In [7]:
univ = Series( ['Harvard', 'MIT', 'Stanford', 'UCLA', 'Columbia'],
index = [1,2,3,4,5]) #인덱스 값 넣기
print(univ)

1     Harvard
2         MIT
3    Stanford
4        UCLA
5    Columbia
dtype: object

In [8]:
## Series 인덱스 확인
print(univ.index)
# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(univ.index))
## Series 값 확인
print(univ.values)
## Series 값 자료형 확인
print(univ.dtype)

Int64Index([1, 2, 3, 4, 5], dtype='int64')
[1, 2, 3, 4, 5]
['Harvard' 'MIT' 'Stanford' 'UCLA' 'Columbia']
object

### Dataframe 만들기

In [10]:
from pandas import DataFrame

In [11]:
dat = { 'col1' : [1,2,3,4],
'col2' : [10,20,30,40],
'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [14]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
"apple":[4000,5000,6000,5500,4500],
"gildong":[2000,2500,3000,4000,3000],
"catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

### 인덱스 명 변경하기

In [16]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score, 
#                     columns=['catanddog', 'toto', 'apple', 'gildong'], # 칼럼 순서 바꾸고 싶으면
                    index=date)
team_df

          toto  apple  gildong  catanddog
19-05-01  1500   4000     2000       7000
19-05-02  3000   5000     2500       5000
19-05-03  5000   6000     3000       3000
19-05-04  7000   5500     4000       5000
19-05-05  5500   4500     3000       4000

###  toto팀의 날짜별 점수를 확인해 보자.
* 팀별 컬럼명을 이용

In [28]:
team_df['toto'] #컬럼 하나 확인

19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64

In [29]:
team_df[ ['toto', 'gildong'] ]  #컬럼 두개 확인

          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000

## loc와 iloc를 이용한 접근
* loc는 데이터 프레임의 컬럼명을 사용하여 데이터 추출한다.
* iloc는 데이터 프레임의 데이터 순서(번호)를 사용하여 데이터 추출(시작번호 : 0)
* loc[ 행, 열] 접근이라고 쉽게 생각한다.

In [38]:
#index 열
team_df.columns

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')

In [31]:
#index 행
team_df.index

Index(['19-05-01', '19-05-02', '19-05-03', '19-05-04', '19-05-05'], dtype='object')

## loc를 이용한 열에 접근

In [32]:
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto']) # 전체행, toto팀
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ]) # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ]) # 전체행, toto 부터 끝까지

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')
-----
19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64
-----
          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000
-----
          toto  apple  gildong
19-05-01  1500   4000     2000
19-05-02  3000   5000     2500
19-05-03  5000   6000     3000
19-05-04  7000   5500     4000
19-05-05  5500   4500     3000

## iloc 속성을 이용한 행, 열 데이터 접근하기

In [17]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
"apple":[4000,5000,6000,5500,4500],
"gildong":[2000,2500,3000,4000,3000],
"catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [34]:
print(team_df.iloc[0]) # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ]) # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] ) # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] ) # 첫번째부터 세번째 행 접근

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 19-05-01, dtype: int64
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000